HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCan_regdef.h
/** \brief TT Global Time Preset ${i} */
typedef struct _Ifx_CAN_N_TT_GTP_Bits
{
    Ifx_UReg_32Bit TP:16;             /**< \brief [15:0] Time Preset - TP (rwh) */
    Ifx_UReg_32Bit CTP:16;            /**< \brief [31:16] Cycle Time Target Phase - CTP (rwh) */
} Ifx_CAN_N_TT_GTP_Bits;

/** \brief TT Interrupt Enable ${i} */
typedef struct _Ifx_CAN_N_TT_IE_Bits
{
    Ifx_UReg_32Bit SBCE:1;            /**< \brief [0:0] Start of Basic Cycle Interrupt Enable - SBCE (rw) */
    Ifx_UReg_32Bit SMCE:1;            /**< \brief [1:1] Start of Matrix Cycle Interrupt Enable - SMCE (rw) */
    Ifx_UReg_32Bit CSME:1;            /**< \brief [2:2] Change of Synchronization Mode Interrupt Enable - CSME (rw) */
    Ifx_UReg_32Bit SOGE:1;            /**< \brief [3:3] Start of Gap Interrupt Enable - SOGE (rw) */
    Ifx_UReg_32Bit RTMIE:1;           /**< \brief [4:4] Register Time Mark Interrupt Enable - RTMIE (rw) */
    Ifx_UReg_32Bit TTMIE:1;           /**< \brief [5:5] Trigger Time Mark Event Internal Interrupt Enable - TTMIE (rw) */
    Ifx_UReg_32Bit SWEE:1;            /**< \brief [6:6] Stop Watch Polarity Interrupt Enable - SWEE (rw) */
    Ifx_UReg_32Bit GTWE:1;            /**< \brief [7:7] Global Time Wrap Interrupt Enable - GTWE (rw) */
    Ifx_UReg_32Bit GTDE:1;            /**< \brief [8:8] Global Time Discontinuity Interrupt Enable - GTDE (rw) */
    Ifx_UReg_32Bit GTEE:1;            /**< \brief [9:9] Global Time Error Interrupt Enable - GTEE (rw) */
    Ifx_UReg_32Bit TXUE:1;            /**< \brief [10:10] Tx Count Underflow Interrupt Enable - TXUE (rw) */
    Ifx_UReg_32Bit TXOE:1;            /**< \brief [11:11] Tx Count Overflow Interrupt Enable - TXOE (rw) */
    Ifx_UReg_32Bit SE1E:1;            /**< \brief [12:12] Scheduling Error 1 Interrupt Enable - SE1E (rw) */
    Ifx_UReg_32Bit SE2E:1;            /**< \brief [13:13] Scheduling Error 2 Interrupt Enable - SE2E (rw) */
    Ifx_UReg_32Bit ELCE:1;            /**< \brief [14:14] Change Error Level Interrupt Enable - ELCE (rw) */
    Ifx_UReg_32Bit IWTE:1;            /**< \brief [15:15] Initialization Watch Trigger Interrupt Enable - IWTE (rw) */
    Ifx_UReg_32Bit WTE:1;             /**< \brief [16:16] Watch Trigger Interrupt Enable - WTE (rw) */
    Ifx_UReg_32Bit AWE:1;             /**< \brief [17:17] Application Watchdog Interrupt Enable - AWE (rw) */
    Ifx_UReg_32Bit CERE:1;            /**< \brief [18:18] Configuration Error Interrupt Enable - CERE (rw) */
    Ifx_UReg_32Bit reserved_19:13;    /**< \brief [31:19] \internal Reserved */
} Ifx_CAN_N_TT_IE_Bits;

/** \brief TT Interrupt Register ${i} */
typedef struct _Ifx_CAN_N_TT_IR_Bits
{
    Ifx_UReg_32Bit SBC:1;             /**< \brief [0:0] Start of Basic Cycle - SBC (rwh) */
    Ifx_UReg_32Bit SMC:1;             /**< \brief [1:1] Start of Matrix Cycle - SMC (rwh) */
    Ifx_UReg_32Bit CSM:1;             /**< \brief [2:2] Change of Synchronization Mode - CSM (rwh) */
    Ifx_UReg_32Bit SOG:1;             /**< \brief [3:3] Start of Gap - SOG (rwh) */
    Ifx_UReg_32Bit RTMI:1;            /**< \brief [4:4] Register Time Mark Interrupt - RTMI (rwh) */
    Ifx_UReg_32Bit TTMI:1;            /**< \brief [5:5] Trigger Time Mark Event Internal - TTMI (rwh) */
    Ifx_UReg_32Bit SWE:1;             /**< \brief [6:6] Stop Watch Polarity - SWE (rwh) */
    Ifx_UReg_32Bit GTW:1;             /**< \brief [7:7] Global Time Wrap - GTW (rwh) */
    Ifx_UReg_32Bit GTD:1;             /**< \brief [8:8] Global Time Discontinuity - GTD (rwh) */
    Ifx_UReg_32Bit GTE:1;             /**< \brief [9:9] Global Time Error - GTE (rwh) */
    Ifx_UReg_32Bit TXU:1;             /**< \brief [10:10] Tx Count Underflow - TXU (rwh) */
    Ifx_UReg_32Bit TXO:1;             /**< \brief [11:11] Tx Count Overflow - TXO (rwh) */
    Ifx_UReg_32Bit SE1:1;             /**< \brief [12:12] Scheduling Error 1 - SE1 (rwh) */
    Ifx_UReg_32Bit SE2:1;             /**< \brief [13:13] Scheduling Error 2 - SE2 (rwh) */
    Ifx_UReg_32Bit ELC:1;             /**< \brief [14:14] Error Level Changed - ELC (rwh) */
    Ifx_UReg_32Bit IWT:1;             /**< \brief [15:15] Initialization Watch Trigger - IWT (rwh) */
    Ifx_UReg_32Bit WT:1;              /**< \brief [16:16] Watch Trigger - WT (rwh) */
    Ifx_UReg_32Bit AW:1;              /**< \brief [17:17] Application Watchdog - AW (rwh) */
    Ifx_UReg_32Bit CER:1;             /**< \brief [18:18] Configuration Error - CER (rwh) */
    Ifx_UReg_32Bit reserved_19:13;    /**< \brief [31:19] \internal Reserved */
} Ifx_CAN_N_TT_IR_Bits;

/** \brief TT Local & Global Time ${i} */
typedef struct _Ifx_CAN_N_TT_LGT_Bits
{
    Ifx_UReg_32Bit LT:16;             /**< \brief [15:0] Local Time - LT (rh) */
    Ifx_UReg_32Bit GT:16;             /**< \brief [31:16] Global Time - GT (rh) */
} Ifx_CAN_N_TT_LGT_Bits;

/** \brief TT Matrix Limits ${i} */
typedef struct _Ifx_CAN_N_TT_MLM_Bits
{
    Ifx_UReg_32Bit CCM:6;             /**< \brief [5:0] Cycle Count Max - CCM (rw) */
    Ifx_UReg_32Bit CSS:2;             /**< \brief [7:6] Cycle Start Synchronization - CSS (rw) */
    Ifx_UReg_32Bit TXEW:4;            /**< \brief [11:8] Tx Enable Window - TXEW (rw) */
    Ifx_UReg_32Bit reserved_12:4;     /**< \brief [15:12] \internal Reserved */
    Ifx_UReg_32Bit ENTT:12;           /**< \brief [27:16] Expected Number of Tx Triggers - ENTT (rw) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_CAN_N_TT_MLM_Bits;

/** \brief TT Operation Configuration ${i} */
typedef struct _Ifx_CAN_N_TT_OCF_Bits
{
    Ifx_UReg_32Bit OM:2;              /**< \brief [1:0] Operation Mode - OM (rw) */
    Ifx_UReg_32Bit reserved_2:1;      /**< \brief [2:2] \internal Reserved */
    Ifx_UReg_32Bit GEN:1;             /**< \brief [3:3] Gap Enable - GEN (rw) */
    Ifx_UReg_32Bit TM:1;              /**< \brief [4:4] Time Master - TM (rw) */
    Ifx_UReg_32Bit LDSDL:3;           /**< \brief [7:5] LD of Synchronization Deviation Limit - LDSDL (rw) */
    Ifx_UReg_32Bit IRTO:7;            /**< \brief [14:8] Initial Reference Trigger Offset - IRTO (rw) */
    Ifx_UReg_32Bit EECS:1;            /**< \brief [15:15] Enable External Clock Synchronization - EECS (rw) */
    Ifx_UReg_32Bit AWL:8;             /**< \brief [23:16] Application Watchdog Limit - AWL (rw) */
    Ifx_UReg_32Bit EGTF:1;            /**< \brief [24:24] Enable Global Time Filtering - EGTF (rw) */
    Ifx_UReg_32Bit ECC:1;             /**< \brief [25:25] Enable Clock Calibration - ECC (rw) */
    Ifx_UReg_32Bit EVTP:1;            /**< \brief [26:26] Event Trigger Polarity - EVTP (rw) */
    Ifx_UReg_32Bit reserved_27:5;     /**< \brief [31:27] \internal Reserved */
} Ifx_CAN_N_TT_OCF_Bits;

/** \brief TT Operation Control ${i} */
typedef struct _Ifx_CAN_N_TT_OCN_Bits
{
    Ifx_UReg_32Bit SGT:1;             /**< \brief [0:0] Set Global time - SGT (rwh) */
    Ifx_UReg_32Bit ECS:1;             /**< \brief [1:1] External Clock Synchronization - ECS (rwh) */
    Ifx_UReg_32Bit SWP:1;             /**< \brief [2:2] Stop Watch Polarity - SWP (rw) */
    Ifx_UReg_32Bit SWS:2;             /**< \brief [4:3] Stop Watch Source - SWS (rw) */
    Ifx_UReg_32Bit RTIE:1;            /**< \brief [5:5] Register Time Mark Interrupt Pulse Enable - RTIE (rw) */
    Ifx_UReg_32Bit TMC:2;             /**< \brief [7:6] Register Time Mark Compare - TMC (rw) */
    Ifx_UReg_32Bit TTIE:1;            /**< \brief [8:8] Trigger Time Mark Interrupt Pulse Enable - TTIE (rw) */
    Ifx_UReg_32Bit GCS:1;             /**< \brief [9:9] Gap Control Select - GCS (rw) */
    Ifx_UReg_32Bit FGP:1;             /**< \brief [10:10] Finish Gap - FGP (rwh) */
    Ifx_UReg_32Bit TMG:1;             /**< \brief [11:11] Time Mark Gap - TMG (rw) */
    Ifx_UReg_32Bit NIG:1;             /**< \brief [12:12] Next is Gap - NIG (rwh) */
    Ifx_UReg_32Bit ESCN:1;            /**< \brief [13:13] External Synchronization Control - ESCN (rw) */
    Ifx_UReg_32Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_UReg_32Bit LCKC:1;            /**< \brief [15:15] TT Operation Control Register Locked - LCKC (rh) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_CAN_N_TT_OCN_Bits;

/** \brief TT Operation Status ${i} */
typedef struct _Ifx_CAN_N_TT_OST_Bits
{
    Ifx_UReg_32Bit EL:2;              /**< \brief [1:0] Error Level - EL (rh) */
    Ifx_UReg_32Bit MS:2;              /**< \brief [3:2] Master State - MS (rh) */
    Ifx_UReg_32Bit SYS:2;             /**< \brief [5:4] Synchronization State - SYS (rh) */
    Ifx_UReg_32Bit QGTP:1;            /**< \brief [6:6] Quality of Global Time Phase - QGTP (rh) */
    Ifx_UReg_32Bit QCS:1;             /**< \brief [7:7] Quality of Clock Speed - QCS (rh) */
    Ifx_UReg_32Bit RTO:8;             /**< \brief [15:8] Reference Trigger Offset - RTO (rh) */
    Ifx_UReg_32Bit reserved_16:6;     /**< \brief [21:16] \internal Reserved */
    Ifx_UReg_32Bit WGTD:1;            /**< \brief [22:22] Wait for Global Time Discontinuity - WGTD (rh) */
    Ifx_UReg_32Bit GFI:1;             /**< \brief [23:23] Gap Finished Indicator - GFI (rh) */
    Ifx_UReg_32Bit TMP:3;             /**< \brief [26:24] Time Master Priority - TMP (rh) */
    Ifx_UReg_32Bit GSI:1;             /**< \brief [27:27] Gap Started Indicator - GSI (rh) */
    Ifx_UReg_32Bit WFE:1;             /**< \brief [28:28] Wait for Event - WFE (rh) */
    Ifx_UReg_32Bit AWE:1;             /**< \brief [29:29] Application Watchdog Event - AWE (rh) */
    Ifx_UReg_32Bit WECS:1;            /**< \brief [30:30] Wait for External Clock Synchronization - WECS (rh) */
    Ifx_UReg_32Bit SPL:1;             /**< \brief [31:31] Schedule Phase Lock - SPL (rh) */
} Ifx_CAN_N_TT_OST_Bits;

/** \brief TT Reference Message Configuration ${i} */
typedef struct _Ifx_CAN_N_TT_RMC_Bits
{
    Ifx_UReg_32Bit RID:29;            /**< \brief [28:0] Reference Identifier - RID (rw) */
    Ifx_UReg_32Bit reserved_29:1;     /**< \brief [29:29] \internal Reserved */
    Ifx_UReg_32Bit XTD:1;             /**< \brief [30:30] Extended Identifier - XTD (rw) */
    Ifx_UReg_32Bit RMPS:1;            /**< \brief [31:31] Reference Message Payload Select - RMPS (rw) */
} Ifx_CAN_N_TT_RMC_Bits;

